---
kind: method
id: M:Autodesk.Revit.DB.ScheduleDefinition.GetSortGroupFieldCount
source: html/e962c669-7aa3-a6d0-3857-82e1fd536c72.htm
---
# Autodesk.Revit.DB.ScheduleDefinition.GetSortGroupFieldCount Method

Gets the number of sorting/grouping fields in this ScheduleDefinition.

## Syntax (C#)
```csharp
public int GetSortGroupFieldCount()
```

## Returns
The number of sorting/grouping fields.